# Таблиця варіантів практичної роботи №12
# Кожен рядок: (lam, mu, Cs, Cw, object_name)
# lam  — інтенсивність потоку заявок, заявок/год
# mu   — інтенсивність обслуговування одним каналом, заявок/год
# Cs   — вартість утримання одного каналу, грн/год
# Cw   — втрати від очікування однієї заявки, грн за годину очікування
# object_name — змістовний об'єкт моделювання (багатоканальна СМО з очікуванням, M/M/c)

VARIANTS = {
    1:  (21, 6, 70,  250, "диспетчерська служба"),
    2:  (27, 8, 80,  325, "сервісний центр"),
    3:  (19, 6, 80,  150, "касовий вузол"),
    4:  (28, 8, 80,  325, "пункт техогляду"),
    5:  (14, 5, 90,  300, "call-центр"),
    6:  (22, 8, 90,  150, "вантажний термінал"),
    7:  (13, 5, 90,  225, "кластер серверів"),
    8:  (29, 7, 70,  325, "пункт видачі замовлень"),
    9:  (24, 5, 100, 350, "станція зарядки"),
    10: (33, 7, 100, 200, "ремонтна бригада"),
    11: (23, 5, 110, 275, "диспетчерська служба"),
    12: (31, 7, 110, 350, "сервісний центр"),
    13: (17, 4, 110, 175, "касовий вузол"),
    14: (29, 7, 120, 250, "пункт техогляду"),
    15: (19, 4, 110, 175, "call-центр"),
    16: (23, 6, 120, 175, "вантажний термінал"),
    17: (15, 4, 60,  250, "кластер серверів"),
    18: (21, 6, 60,  300, "пункт видачі замовлень"),
    19: (27, 8, 60,  150, "станція зарядки"),
    20: (19, 6, 70,  225, "ремонтна бригада"),
    21: (25, 8, 100, 200, "диспетчерська служба"),
    22: (17, 6, 80,  150, "сервісний центр"),
    23: (22, 8, 80,  200, "касовий вузол"),
    24: (13, 5, 80,  275, "пункт техогляду"),
    25: (29, 8, 120, 300, "call-центр"),
    26: (24, 5, 90,  200, "вантажний термінал"),
    27: (33, 7, 90,  275, "кластер серверів"),
    28: (23, 5, 100, 325, "пункт видачі замовлень"),
    29: (31, 7, 100, 175, "станція зарядки"),
    30: (17, 4, 100, 250, "ремонтна бригада"),
}
